6.laminar flow around a cylinder/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    inlet
    {
	type		zeroGradient;
    }
    
    outlet
    {
	type		totalPressure;
	p0		uniform 101325;
	value		uniform 101325;
	rho		rho;
	gamma		1.4;
    }
    
    tube-walls
    {
	type		zeroGradient;
    }
    
    cyl-walls
    {
	type		zeroGradient;
    }
    
    defaultFaces
    {
	type		empty;
    }
}


// ************************************************************************* //
