6.laminar flow around a cylinder/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
LiqPhaseName    Liq;
GasPhaseName    Gas;

pMin            pMin [ 1 -1 -2 0 0 0 0 ] 1;

Liq
{
    //not used in this simulation
    p           p;
    T           T;
    
    Cp          4186;
    Cv          4000.0;
    mu          1;
    Pr          1;
    rho0        1000;
    p0          1.0e+5;
    T0          273.0;
    R           6934;
    H0          0;
}

Gas
{
    p           p;
    T           T;

    Cp          1004.5;
    Cv          717.5;
    mu          18.5e-6;
    Pr          0.73;
    rho0        0.0;
    p0          0.0;
    T0          0.0;
    R           287;
    H0          2.544e+6;
}

Pc     22.5;
Tc     623.0;
Pt     10e+5;
Tt     400;


saturationModel
{
    type constant;
    pSat   1e+7;
    Tsat   500;
    
}
// ************************************************************************* //
