6.laminar flow around a cylinder/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleCentralFoam;

startFrom       latestTime;//startTime;

startTime       0;

stopAt          endTime;

endTime         0.005;

deltaT          2e-08;//2e-05;

writeControl    adjustableRunTime;

writeInterval   1e-4;

cycleWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   10;

runTimeModifiable true;

adjustTimeStep  true;

maxCo           0.5;

CourantType	cellCourant;

maxDeltaT       1;

functions
{

    forces1
    {
        
        type            forces;
        functionObjectLibs ( "libforces.so" );
        outputControl   timeStep;
        outputInterval  1;
        
        patches
        (
            cyl-walls
        );
        
        log         true;
        CofR        ( 0 0 0 );
        liftDir     ( 0 1 0 );
        dragDir     ( 1 0 0 );
        pitchAxis   ( 0 0 1 );
        magUInf     10;
        lRef        0.157575e-3;
        Aref        2.48283049e-09;
    }
}


// ************************************************************************* //
