6.laminar flow around a cylinder/system/decomposeParDict
// Mesh decomposition control dictionary

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

FoamFile
{
    version 0.5;
    format ascii;

    root     "ROOT";
    case     "CASE";
    instance "system";
    local    "";

    class dictionary;

    object decompositionDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains   14;

method               scotch;

scotchCoeffs
{
}


// ************************************************************************* //
